Revit 2015 API
Document.NewGrid Method
 Creates a new grid line.
Overload List
Name | Description
NewGrid(Arc)
 Creates a new radial grid line.
NewGrid(Line)
 Creates a new linear grid line.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace